<template>
  <div class="content mt40">
    <div class="newsList">
      <ul>
        <li>
          <a>
            <h2>这是栏目的东西，栏目的东西</h2>
            <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
          </a>
        </li>
        <li>
          <a>
            <h2>还可以降低首付款健身房还可以降低首付款健身房还可以降低首付款健身房333</h2>
            <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
          </a>
        </li>
        <li>
          <a>
            <h2>还可以降低首付款健身房还可以降低首付款健身房还可以降低首付款健身房333</h2>
            <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
          </a>
        </li>
        <li>
          <a>
            <h2>还可以降低首付款健身房还可以降低首付款健身房还可以降低首付款健身房333</h2>
            <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
          </a>
        </li>
        <li>
          <a>
            <h2>还可以降低首付款健身房还可以降低首付款健身房还可以降低首付款健身房333</h2>
            <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
          </a>
        </li>
        <li>
          <a>
            <h2>还可以降低首付款健身房还可以降低首付款健身房还可以降低首付款健身房333</h2>
            <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
          </a>
        </li>
        <li>
          <a>
            <h2>还可以降低首付款健身房还可以降低首付款健身房还可以降低首付款健身房333</h2>
            <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
          </a>
        </li>
        <li>
          <a>
            <h2>还可以降低首付款健身房还可以降低首付款健身房还可以降低首付款健身房333</h2>
            <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
          </a>
        </li>
      </ul>
    </div>
  </div>
</template>

<style scoped>
  .mt40 {
    margin-top: 40px;
  }

  .content {
    width: 100%;
    margin-bottom: 49px;
  }

  .content .newsList {
    width: 90%;
    margin: 0 auto;
  }

  .newsList ul {
    padding: 0 10px;
  }

  .newsList ul li {
    color: #494d4d;
    padding: 10px 0;
    border-bottom: 1px dashed #ccc;
  }

  .newsList ul li h2 {
    max-height: 20px;
    font-size: 18px;
    overflow: hidden;
  }

  .newsList ul li p {
    max-height: 80px;
    margin-top: 10px;
    overflow: hidden;
  }
</style>
